package wordz

import (
	"crypto/rand"
	"math/big"
	mathrand "math/rand"
)

var FakeNames = []string{
	"Иван", "Алексей", "Екатерина", "Мария",
	"Андрей", "Ольга", "Николай", "Татьяна",
	"Сергей", "Анна", "Дмитрий", "Елена",
	"Максим", "Наталья", "Павел", "Любовь",
	"Артем", "Анастасия", "Алиса", "Владимир",
	"Олег", "Ксения", "Григорий", "Марина",
	"Ирина", "Роман", "Евгений", "Виктория",
	"Константин", "Елизавета", "Александр", "Оксана",
	"Василий", "Юлия", "Анатолий", "Инна",
	"Михаил", "Вера", "Георгий", "Светлана",
	"Артур", "Маргарита", "Валерий", "Тамара",
	"Руслан", "Лариса", "Егор", "Ольга",
	"Никита", "Евгения", "Илья", "Екатерина",
	"Марат", "Алина", "Глеб", "Милана",
	"Александр", "Ирина",
}

var FakeSurname = []string{
	"Смирнов", "Иванов", "Кузнецов", "Попов",
	"Соколов", "Лебедев", "Козлов", "Новиков",
	"Морозов", "Петров", "Волков", "Соловьев",
	"Васильев", "Зайцев", "Павлов", "Семенов",
	"Голубев", "Виноградов", "Богданов", "Воробьев",
	"Федоров", "Михайлов", "Беляев", "Тарасов",
	"Белов", "Комаров", "Орлов", "Киселев",
	"Макаров", "Андреев", "Ковалев", "Ильин",
	"Гусев", "Титов", "Кузьмин", "Кудрявцев",
	"Баранов", "Куликов", "Алексеев", "Степанов",
	"Яковлев", "Сорокин", "Сергеев", "Романов",
	"Захаров", "Борисов", "Королев", "Герасимов",
	"Пономарев", "Григорьев", "Лазарев", "Медведев",
	"Ершов", "Никитин", "Соболев", "Рябов",
	"Поляков", "Цветков", "Данилов",
}

type fakeWordsData struct {
	randInt   *big.Int
	fakeWords []string
}

func RandomWord(fakeWords []string) string {
	max := len(fakeWords)
	r, _ := rand.Int(rand.Reader, big.NewInt(int64(max)))
	dataRand := &fakeWordsData{
		randInt:   r,
		fakeWords: fakeWords,
	}
	return get(dataRand)
}

func get(data *fakeWordsData) string {
	return data.fakeWords[data.randInt.Int64()]
}

func RandomBool() bool {
	randomNumber := mathrand.Intn(2)
	return randomNumber == 1
}
